# CreateRibbonPanel Method (Tab, String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationEntryPoint..::..CreateRibbonPanel Method (Tab, String)
ApplicationEntryPoint Class See Also
---
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
```

Visual Basic
---
```text
Public Overrides Function CreateRibbonPanel ( _
	tab As Tab, _
	panelName As String _
) As RibbonPanel
```

Visual C++
---
```text
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
) override
```

# ### Parameters
tab
    Type: Autodesk.Revit.UI..::..Tab
panelName
    Type: System..::..String
# See Also
ApplicationEntryPoint Class
CreateRibbonPanel Overload
Autodesk.Revit.UI.Macros Namespace